In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sklearn import linear_model

In [3]:
df=pd.read_csv("carprices1.csv")
df

    Mileage  Age(yrs)  Sell Price($)
0     69000         6          18000
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
5     59000         5          26750
6     52000         5          32000
7     72000         6          19300
8     91000         8          12000
9     67000         6          22000
10    83000         7          18700
11    79000         7          19500
12    59000         5          26000
13    58780         4          27500
14    82450         7          19400
15    25400         3          35000
16    28000         2          35500
17    69000         5          19700
18    87600         8          12800
19    52000         5          28200

In [5]:
X=df[['Mileage','Age(yrs)']]
y=df['Sell Price($)']

In [6]:
X

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5
13    58780         4
14    82450         7
15    25400         3
16    28000         2
17    69000         5
18    87600         8
19    52000         5

In [7]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     26750
6     32000
7     19300
8     12000
9     22000
10    18700
11    19500
12    26000
13    27500
14    19400
15    35000
16    35500
17    19700
18    12800
19    28200
Name: Sell Price($), dtype: int64

In [8]:
from sklearn.model_selection import train_test_split

In [37]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [38]:
len(X_train)

16

In [39]:
len(X_test)

4

In [40]:
X_train

    Mileage  Age(yrs)
1     35000         3
18    87600         8
0     69000         6
7     72000         6
8     91000         8
15    25400         3
4     46000         4
6     52000         5
9     67000         6
3     22500         2
12    59000         5
5     59000         5
13    58780         4
14    82450         7
19    52000         5
16    28000         2

In [41]:
X_test

    Mileage  Age(yrs)
2     57000         5
11    79000         7
17    69000         5
10    83000         7

In [42]:
reg=linear_model.LinearRegression()

In [43]:
reg.fit(X_train,y_train)

LinearRegression()

In [44]:
reg.predict(X_test)

array([26083.04027663, 17654.56271341, 22747.15921339, 16542.60235899])

In [45]:
reg.score(X_test,y_test)

0.50779028762338